// // - Создать произвольный елемент с id = text. Используя JavaScript, сделайте так,
// //   чтобы при клике на кнопку исчезал элемент с id="text".
// let el = document.getElementById('text');
// let bttn = document.getElementById('form')
// bttn.onclick = (ev) => {
//     ev.preventDefault()
//     console.log('hello')
//     // el.removeAttribute('id')
//     el.remove()
// }

// // - Создайте кнопку, при клике на которую, она будет скрывать сама себя.
// let bttn = document.getElementById('form')
// bttn.onclick = (ev) => {
//     ev.preventDefault()
//     bttn.remove()
// }

// // - Створити інпут який приймає вік людини та кнопку яка підтверджує дію.
// //   При натисканні на кнопку зчитати інформацію з інпуту та перевірити вік чи меньше він ніж 18, та повідомити
// //   про це користувача
//
// let arr = document.querySelector('form')
// let [inPut , bttn] = arr;
// // console.log(arr)
// // console.log(inPut)
// // console.log(bttn)
// // inPut.oninput = () => {
// //     console.log(inPut.value)
// // }
//
// bttn.onclick = (ev) =>{
//     // ev.preventDefault();
//     // if (inPut.value>=18){
//     //     alert('Welcome')
//     // }else {alert('Тобі менше 18')}
//     alert(`You are ${inPut.value} years old!`)
//
// }


// - Создайте меню, которое раскрывается/сворачивается при клике
//
// - Создать список комментариев , пример объекта коментария - {title : 'lorem', body:'lorem ipsum dolo sit ameti'}.
//   Вывести список комментариев в документ, каждый в своем блоке.
//   Добавьте каждому комментарию по кнопке для сворачивания его body.
//
// - Створити 2 форми  по 2 інпути в кожній. ствоирити кнопку при кліку на яку считується та виводиться на консоль
//   інформація з цих 2х форм.
//   Кнопка повинна лежати за межами форм (Щоб ьуникнути  перезавантаження сторінки)
//   Доступ до інпутів через Forms API. Отже дайте формі та інпутам всі необхідні атрибути.
//
// - Створити функцію, яка генерує таблицю.
//   Перший аргумент визначає кількість строк.
//   Другий параметр визначає кліькіть ячеєк в кожній строці.
//   Третій параметр визначає елемент в який потрібно таблицю додати.
//
// - Напишите «Карусель» – ленту изображений, которую можно листать влево-вправо нажатием на стрелочки.