// // 1. Три різних числа вводяться через prompt().
// // За допомоги if else вивести іх в порядку зростання. (відсортувати по зростанню)
//
// let n1 = +prompt('Введіть перше число:');
// let n2 = +prompt('Введіть друге число:');
// let n3 = +prompt('Введіть третє число:');
// if (n1 > n2 && n1 > n3) {
//     if (n2 > n3) {
//         console.log(n3, n2, n1);
//     } else {
//         console.log(n2, n3, n1);
//     }
// }else if (n2>n1 && n2>n3) {
//     if (n1 > n3) {
//         console.log(n3, n1, n2)
//     } else {
//         console.log(n1, n3, n2)
//     }
// }else if (n3>n1 && n3>n2){
//     if (n1>n2){
//         console.log(n2, n1, n3);
//     } else {
//         console.log(n1, n2, n3)
//     }

// // 2.
// // Все параматры получаем с клавиатуры!!!!
// // Имитируем поведение пешехода на перекстке.
// // Если светофор зеленый - вывести "иди".
// // Если светофор желтый - вывести "подожди".
// // Если светофор красный - вывести "стой".
// // Если светофор в аварийном режиме вывести "делай что хочешь"!
//
// let color = prompt('Яким кольором світиться світлофор("зелений","жовтий","червоний","мигає")?');
// if(color==='зелений'){
//     console.log('іди')
// }else if(color==='жовтий'){
//     console.log('почекай')
// }else if(color==='червоний'){
//     console.log('стій')
// }else if(color==='мигає'){
//     console.log('роби що хочеш')
// }

// 3
// Все параметры получаем с клавиатуры!!!!(prompt , confirm)
// Создать переменную isRoadClear которая характеризирует наличие на дороге машин.
// Улучшаем предыдущее задание.
// Если светофор зеленый и машин нет - вывести "иди".
// Если светофор зеленый и машины есть  - вывести подожди пока нарушители проедут".
// Если светофор желтый и машины есть - вывести "жди".
// Если светофор желтый и машин нет - вывести "все рано жди".
// Если светофор красный и машин нет- вывести "стой все рано".
// Если светофор красный - и машины есть вывести "стой и жди".
// Если светофор в аварийном режиме вывести "делай что хочешь"!

let color = prompt('Яким кольором світиться світлофор("зелений","жовтий","червоний","мигає")?');
let isRoadClear = confirm('дорога чиста?')
if(color==='зелений' && isRoadClear){
    console.log('іди')
}else if(color==='зелений' && !isRoadClear){
    console.log('чекай поки порушники проїдуть')
}else if(color==='жовтий' && isRoadClear){
    console.log('все одно чекай')
}else if(color==='жовтий' && !isRoadClear){
    console.log('чекай')
}else if(color==='червоний' && isRoadClear){
    console.log('стій поки рано')
}else if(color==='червоний' && !isRoadClear){
    console.log('стій і чекай')
}else if(color==='мигає'){
    console.log('роби що хочеш')
}