// - Подивіться на наступні вирази і спробуйте вгадати яким буде вивід в консоль. Перевірте себе.
  console.log(132 > 100 && 45 < 12 );
  console.log(34 > 33 && 23 < 90 );
  console.log(99 > 100 && 45 > 12 );
  console.log(132 > 100 || 45 < 12 );
  console.log(111 > 11 || 45 < 111 );
  console.log((111 > 11 || 45 < 111) && (132 > 100 || 45 < 12) );
  console.log((111 > 11 || 45 < 56) || (132 > 100 || 45 < 12) );
  console.log((132 > 100 && 45 < 12 ) && (132 > 100 || 45 < 12 ) );
  console.log((111 > 11 || 45 < 111) || (99 > 100 && 45 > 12 ));
  console.log(!!'-1');
  console.log(!!-1);
  console.log(!!'0');
  console.log(!!'null');
  console.log(!!'undefined');
  console.log(!!(3/'owu'));
  console.log((111 > 11 || 45 < 111) ||  !!'0');
  console.log((!!111 == !!11 || 45 < 111) && (99 > 100 && 45 > 12 ));
