// // 1. Оголосіть змінні str, num, flag и txt зі значеннями «Привіт», 123, true, «true».
// //    За допомогою typeof переконайтесь, що значення змінних належать типам: string, number и  boolean.
// let str = 'Привіт';
// let num = 123;
// let flag = true;
// let txt = 'true';
// console.log(typeof str);
// console.log(typeof num);
// console.log(typeof flag);
// console.log(typeof txt);

// // 2. Оголосіть змінні a1, a2, a3, a4, a5. За домогою 3х математичних оператцій отримайте числа:
// //     34,
// //     12,
// //     66,
// //     90,
// //     87
// //     Старайтесь використовувати різні оператори.
// //     Example: 88 = (16 / 2) * 11
// let a1 = (20-3)*2;
// let a2 = (22+2)/2;
// let a3 = 99/3*2;
// let a4 = (3+6)*10;
// let a5 = 80+10-3;

// //3.  Створіть змінні a6, a7, a8, a9, a10. Запишіть в них результати виразів:
// //     5 % 3,
// //     3 % 5,
// //     5 + '3',
// //     '5' - 3,
// //     75 + 'кг'
// let a6 = 5 % 3;
// let a7 = 3 % 5;
// let a8 = 5 + '3';
// let a9 = '5' - 3;
// let a10 = 75 + 'кг';
// console.log(a6)
// console.log(a7)
// console.log(a8)
// console.log(a9)
// console.log(a10)

// // 4. Напищіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// //    Значееня площі зберігати в змінній s.
// let height = 23;
// let width = 10;
// let s = height * width;
// console.log(s)

// // 5.  Напиши код, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC),
// //     результат поместите в переменную v.
// let heightC = 10;
// let dC = 4;
// let v = heightC * Math.pow(dC/2,2) * 3.14;

// // 6. У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4).
// //    Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень) или оператор возведения в степень ** ).
// let n = 3;
// let m = 4;
// let k = Math.sqrt(n**2 + m**2);
// console.log(k);

// // 7. Напишите скрипт, который выводит "Hello world", создавши переменную str и выводить спомощью document.write, alert и console.log
// let str = 'Hello world';
// document.write(str);
// alert(str);
// console.log(str);

// // 8. Вывести в окно браузера при помощи метода alert() следующие данные: Ваше ФИО, возраст, хобби (каждой на новой строки спомощью \n).
// alert('Mahas Yaroslav\n28\ntennis')

// // 9. Создать 4 переменные с использованием ключевого слова let с именами str1, str2, str3, concatenation.
// //   Переменной str1 присвоить фразу ‘Кто ‘, str2 – ‘ты ‘, str3 – ‘такой?’
// //   Локальной переменной concatenation присвоить результат конкатенации 3-х строк: str1, str2, str3.
// //   Вывести в документ содержимое переменной concatenation спомощью document.write
// let str1 = 'Хто';
// let str2 = ' ти';
// let str3 = ' такий?'
// let concatenation = str1 + str2 + str3;
// document.write(concatenation);

// // 10. Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?
//     let str = "20";
//      let a = 5;
//      document.write(str + a + "<br/>");//бо перша стрінга і друге значення трансформується в стрінгу і відбувається конкатенація
//      document.write(str - a + "<br/>");// перша стрінга через знак віднімання трансформується в число і відбувається віднімання
//      document.write(str * "2" + "<br/>");//те саме але через знак множення
//      document.write(str / 2 + "<br/>");// те саме через знак ділення

// // 11. Какие значения выведет в окно консоли следующий фрагмент кода если его поместить в console.log?
//     parseInt("3.14")//3
//     parseInt("-7.875")//-7
//     parseInt("435")//435
//     parseInt("Вася")//not a number

// // 12.  С помощью окна ввода, вызываемого методом prompt, пользователь может ввести данные, которые будут использоваться далее, повторите код ниже
//     let str = prompt("Enter something", "ho-ho")
//     console.log(str);

// // 13. С помощью окна ввода, вызываемого методом prompt, сделать сложение двух чисел, а вывод результата при помощи метода alert
// let n1 = +prompt('Введіть перше число:');
// let n2 = +prompt('Введіть друге число:');
// let sum = alert('Ваша сума: '+parseInt(n1+n2));

// // 14. С помощью окна ввода, вызываемого методом prompt, пользователь последовательно выводит имя, фамилию и возраст, а вам не обходимо вывести строку такого вида
// //       Доброго вечера Иван Иванов, мои поздравления что вам 32 , а вывод результата при помощи метода alert
// let name = prompt('what is your name?');
// let surname = prompt('what is your surname?');
// let age = prompt('how old are you?');
// alert('Good afternoon '+name+' '+surname+', my congatulations that you are '+age+' years old.')
